ElectroHeavenVN/IoT_Libraries/ZaloBotESP/ESP8266HTTPClientMod.cpp
    // send Header
    if(!sendHeader(type)) {
        return returnError(HTTPCLIENTMOD_HTTPC_ERROR_SEND_HEADER_FAILED);
    }

    // transfer all of it, with timeout
    size_t transferred = stream->sendSize(_client.get(), size);
    if (transferred != size)
    {
        DEBUG_HTTPCLIENT("[HTTP-Client][sendRequest] short write, asked for %zu but got %zu failed.\n", size, transferred);
        esp_yield();
        return returnError(HTTPCLIENTMOD_HTTPC_ERROR_SEND_PAYLOAD_FAILED);
    }

    // handle Server Response (Header)
    return returnError(handleHeaderResponse());
}

/**
 * size of message body / payload
 * @return -1 if no info or > 0 when Content-Length is set by server
 */
int HTTPClientMod::getSize(void)
{
    return _size;
}

/**
 * Location if redirect
 */
const String& HTTPClientMod::getLocation(void)
{
    return _location;
}

/**
 * returns the stream of the tcp connection
 * @return WiFiClient
 */
WiFiClient& HTTPClientMod::getStream(void)
{
    if(connected()) {
        return *_client;
    }

    DEBUG_HTTPCLIENT("[HTTP-Client] getStream: not connected\n");
    static WiFiClient empty;
    return empty;
}

/**
 * returns the stream of the tcp connection
 * @return WiFiClient *
 */
WiFiClient* HTTPClientMod::getStreamPtr(void)
{
    if(connected()) {
        return _client.get();
    }

    DEBUG_HTTPCLIENT("[HTTP-Client] getStreamPtr: not connected\n");
    return nullptr;
}

/**
 * write all  message body / payload to Stream
 * @param stream Stream *
 * @return bytes written ( negative values are error codes )
 */
int HTTPClientMod::writeToStream(Stream * stream)
{
    return writeToPrint(stream);
}

/**
 * write all  message body / payload to Print
 * @param print Print *
 * @return bytes written ( negative values are error codes )
 */
int HTTPClientMod::writeToPrint(Print * print)
{

    if(!print) {
        return returnError(HTTPCLIENTMOD_HTTPC_ERROR_NO_STREAM);
    }

    // Only return error if not connected and no data available, because otherwise ::getString() will return an error instead of an empty
    // string when the server returned a http code 204 (no content)
    if(!connected() && _transferEncoding != HTTPCLIENTMOD_HTTPC_TE_IDENTITY && _size > 0) {
        return returnError(HTTPCLIENTMOD_HTTPC_ERROR_NOT_CONNECTED);
    }

    // get length of document (is -1 when Server sends no Content-Length header)
    int len = _size;
    int ret = 0;

    if(_transferEncoding == HTTPCLIENTMOD_HTTPC_TE_IDENTITY) {
        // len < 0: transfer all of it, with timeout
        // len >= 0: max:len, with timeout
        ret = _client->sendSize(print, len);

        // do we have an error?
        if(_client->getLastSendReport() != Stream::Report::Success) {
            return returnError(StreamReportToHttpClientReport(_client->getLastSendReport()));
        }
    } else if(_transferEncoding == HTTPCLIENTMOD_HTTPC_TE_CHUNKED) {
        int size = 0;
        while(1) {
            if(!connected()) {
                return returnError(HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_LOST);
            }
            String chunkHeader = _client->readStringUntil('\n');

            if(chunkHeader.length() <= 0) {
                return returnError(HTTPCLIENTMOD_HTTPC_ERROR_READ_TIMEOUT);
            }

            chunkHeader.trim(); // remove \r

            // read size of chunk
            len = (uint32_t) strtol((const char *) chunkHeader.c_str(), NULL, 16);
            size += len;
            DEBUG_HTTPCLIENT("[HTTP-Client] read chunk len: %d\n", len);

            // data left?
            if(len > 0) {
                // read len bytes with timeout
                int r = _client->sendSize(print, len);
                if (_client->getLastSendReport() != Stream::Report::Success)
                    // not all data transferred
                    return returnError(StreamReportToHttpClientReport(_client->getLastSendReport()));
                ret += r;
            } else {

                // if no length Header use global chunk size
                if(_size <= 0) {
                    _size = size;
                }

                // check if we have write all data out
                if(ret != _size) {
                    return returnError(HTTPCLIENTMOD_HTTPC_ERROR_STREAM_WRITE);
                }
                break;
            }

            // read trailing \r\n at the end of the chunk
            char buf[2];
            auto trailing_seq_len = _client->readBytes((uint8_t*)buf, 2);
            if (trailing_seq_len != 2 || buf[0] != '\r' || buf[1] != '\n') {
                return returnError(HTTPCLIENTMOD_HTTPC_ERROR_READ_TIMEOUT);
            }

            esp_yield();
        }
    } else {
        return returnError(HTTPCLIENTMOD_HTTPC_ERROR_ENCODING);
    }

    disconnect(true);
    return ret;
}

/**
 * return all payload as String (may need lot of ram or trigger out of memory!)
 * @return String
 */
const String& HTTPClientMod::getString(void)
{
    if (_payload) {
        return *_payload;
    }

    _payload.reset(new StreamString());

    if(_size > 0) {
        // try to reserve needed memory
        if(!_payload->reserve((_size + 1))) {
            DEBUG_HTTPCLIENT("[HTTP-Client][getString] not enough memory to reserve a string! need: %d\n", (_size + 1));
            return *_payload;
        }
    }

    writeToStream(_payload.get());
    return *_payload;
}

/**
 * converts error code to String
 * @param error int
 * @return String
 */
String HTTPClientMod::errorToString(int error)
{
    switch(error) {
    case HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_FAILED:
        return F("connection failed");
    case HTTPCLIENTMOD_HTTPC_ERROR_SEND_HEADER_FAILED:
        return F("send header failed");
    case HTTPCLIENTMOD_HTTPC_ERROR_SEND_PAYLOAD_FAILED:
        return F("send payload failed");
    case HTTPCLIENTMOD_HTTPC_ERROR_NOT_CONNECTED:
        return F("not connected");
    case HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_LOST:
        return F("connection lost");
    case HTTPCLIENTMOD_HTTPC_ERROR_NO_STREAM:
        return F("no stream");
    case HTTPCLIENTMOD_HTTPC_ERROR_NO_HTTP_SERVER:
        return F("no HTTP server");
    case HTTPCLIENTMOD_HTTPC_ERROR_TOO_LESS_RAM:
        return F("not enough ram");
    case HTTPCLIENTMOD_HTTPC_ERROR_ENCODING:
        return F("Transfer-Encoding not supported");
    case HTTPCLIENTMOD_HTTPC_ERROR_STREAM_WRITE:
        return F("Stream write error");
    case HTTPCLIENTMOD_HTTPC_ERROR_READ_TIMEOUT:
        return F("read Timeout");
    default:
        return String();
    }
}

/**
 * adds Header to the request
 * @param name
 * @param value
 * @param first
 */
void HTTPClientMod::addHeader(const String& name, const String& value, bool first, bool replace)
{
    // not allow set of Header handled by code
    if (!name.equalsIgnoreCase(F("Connection")) &&
        !name.equalsIgnoreCase(F("User-Agent")) &&
        !name.equalsIgnoreCase(F("Host")) &&
        !(name.equalsIgnoreCase(F("Authorization")) && _base64Authorization.length())) {

