ElectroHeavenVN/IoT_Libraries/ZaloBotESP/ESP8266HTTPClientMod.cpp
                if(_size > 0) {
                    DEBUG_HTTPCLIENT("[HTTP-Client][handleHeaderResponse] size: %d\n", _size);
                }

                if(transferEncoding.length() > 0) {
                    DEBUG_HTTPCLIENT("[HTTP-Client][handleHeaderResponse] Transfer-Encoding: %s\n", transferEncoding.c_str());
                    if(transferEncoding.equalsIgnoreCase(F("chunked"))) {
                        _transferEncoding = HTTPCLIENTMOD_HTTPC_TE_CHUNKED;
                    } else {
                        _returnCode = HTTPCLIENTMOD_HTTPC_ERROR_ENCODING;
                        return _returnCode;
                    }
                } else {
                    _transferEncoding = HTTPCLIENTMOD_HTTPC_TE_IDENTITY;
                }

                if(_returnCode <= 0) {
                    DEBUG_HTTPCLIENT("[HTTP-Client][handleHeaderResponse] Remote host is not an HTTP Server!");
                    _returnCode = HTTPCLIENTMOD_HTTPC_ERROR_NO_HTTP_SERVER;
                }
                return _returnCode;
            }

        } else {
            if((millis() - lastDataTime) > _tcpTimeout) {
                return HTTPCLIENTMOD_HTTPC_ERROR_READ_TIMEOUT;
            }
            esp_yield();
        }
    }

    return HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_LOST;
}

/**
 * called to handle error return, may disconnect the connection if still exists
 * @param error
 * @return error
 */
int HTTPClientMod::returnError(int error)
{
    if(error < 0) {
        DEBUG_HTTPCLIENT("[HTTP-Client][returnError] error(%d): %s\n", error, errorToString(error).c_str());
        if(connected()) {
            DEBUG_HTTPCLIENT("[HTTP-Client][returnError] tcp stop\n");
            _client->stop();
        }
    }
    return error;
}

//Async

int HTTPClientMod::sendRequestAsync(const char* type, const String& payload)
{
    return sendRequestAsync(type, (const uint8_t *) payload.c_str(), payload.length());
}

int HTTPClientMod::sendRequestAsync(const char* type, const uint8_t* payload, size_t size)
{
    // wipe out any existing headers from previous request
    for(size_t i = 0; i < _headerKeysCount; i++) {
        if (_currentHeaders[i].value.length() > 0) {
            _currentHeaders[i].value.clear();
        }
    }

    // connect to server
    if(!connect()) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_FAILED);
    }

    addHeader(F("Content-Length"), String(payload && size > 0 ? size : 0));

    // send Header
    if(!sendHeader(type)) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_SEND_HEADER_FAILED);
    }

    // transfer all of it, with send-timeout
    if (size && StreamConstPtr(payload, size).sendAll(_client.get()) != size) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_SEND_PAYLOAD_FAILED);
    }

    lastSendRequestAsyncTime = millis();
    asyncHttpCode = 0;
    return asyncHttpCode;
}

int HTTPClientMod::sendRequestAsync(const char* type, Stream * stream, size_t size)
{
    if(!stream) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_NO_STREAM);
    }

    // connect to server
    if(!connect()) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_FAILED);
    }

    if(size > 0) {
        addHeader(F("Content-Length"), String(size));
    }

    // send Header
    if(!sendHeader(type)) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_SEND_HEADER_FAILED);
    }

    // transfer all of it, with timeout
    size_t transferred = stream->sendSize(_client.get(), size);
    if (transferred != size)
    {
        DEBUG_HTTPCLIENT("[HTTP-Client][sendRequestAsync] short write, asked for %zu but got %zu failed.\n", size, transferred);
        esp_yield();
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_SEND_PAYLOAD_FAILED);
    }

    lastSendRequestAsyncTime = millis();
    asyncHttpCode = 0;
    return asyncHttpCode;
}

int HTTPClientMod::processResponseAsync()
{
    if(!connected()) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_NOT_CONNECTED);
    }
    if (asyncTimeout()) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_READ_TIMEOUT);
    }
    size_t len = _client->available();
    if(len <= 0) //Server did not send any data yet
        return 0;
    
    clear();
    _canReuse = _reuse;
    String transferEncoding;
    _transferEncoding = HTTPCLIENTMOD_HTTPC_TE_IDENTITY;
    int headerSeparator = -1;
    String headerLine = _client->readStringUntil('\n');

    lastSendRequestAsyncTime = millis();
    while(connected()) {
        size_t len = _client->available();
        if(len > 0) {
            int headerSeparator = -1;
            String headerLine = _client->readStringUntil('\n');

            lastSendRequestAsyncTime = millis();
            DEBUG_HTTPCLIENT("[HTTP-Client][getResponseTextAsync] RX: '%s'\n", headerLine.c_str());

            if (headerLine.startsWith(F("HTTP/1."))) {

                constexpr auto httpVersionIdx = sizeof "HTTP/1." - 1;
                _canReuse = _canReuse && (headerLine[httpVersionIdx] != '0');
                asyncHttpCode = headerLine.substring(httpVersionIdx + 2, headerLine.indexOf(' ', httpVersionIdx + 2)).toInt();
                _canReuse = _canReuse && (asyncHttpCode > 0) && (asyncHttpCode < 500);

            } else if ((headerSeparator = headerLine.indexOf(':')) > 0) {
                String headerName = headerLine.substring(0, headerSeparator);
                String headerValue = headerLine.substring(headerSeparator + 1);
                headerValue.trim();

                if(headerName.equalsIgnoreCase(F("Content-Length"))) {
                    _size = headerValue.toInt();
                }

                if(_canReuse && headerName.equalsIgnoreCase(F("Connection"))) {
                    if (headerValue.indexOf(F("close")) >= 0 &&
                            headerValue.indexOf(F("keep-alive")) < 0) {
                        _canReuse = false;
                    }
                }

                if(headerName.equalsIgnoreCase(F("Transfer-Encoding"))) {
                    transferEncoding = headerValue;
                }

                if(headerName.equalsIgnoreCase(F("Location"))) {
                    _location = headerValue;
                }

                for (size_t i = 0; i < _headerKeysCount; i++) {
                    if (_currentHeaders[i].key.equalsIgnoreCase(headerName)) {
                        if (!_currentHeaders[i].value.isEmpty()) {
                            // Existing value, append this one with a comma
                            _currentHeaders[i].value += ',';
                            _currentHeaders[i].value += headerValue;
                        } else {
                            _currentHeaders[i].value = headerValue;
                        }
                        break; // We found a match, stop looking
                    }
                }
                continue;
            }

            headerLine.trim(); // remove \r

            if (headerLine.isEmpty()) {
                DEBUG_HTTPCLIENT("[HTTP-Client][getResponseTextAsync] code: %d\n", asyncHttpCode);

