ElectroHeavenVN/IoT_Libraries/ZaloBotESP/ESP8266HTTPClientMod.cpp
                if(_size > 0) {
                    DEBUG_HTTPCLIENT("[HTTP-Client][getResponseTextAsync] size: %d\n", _size);
                }

                if(transferEncoding.length() > 0) {
                    DEBUG_HTTPCLIENT("[HTTP-Client][getResponseTextAsync] Transfer-Encoding: %s\n", transferEncoding.c_str());
                    if(transferEncoding.equalsIgnoreCase(F("chunked"))) {
                        _transferEncoding = HTTPCLIENTMOD_HTTPC_TE_CHUNKED;
                    } else {
                        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_ENCODING);
                    }
                } else {
                    _transferEncoding = HTTPCLIENTMOD_HTTPC_TE_IDENTITY;
                }

                if(asyncHttpCode < 0) {
                    DEBUG_HTTPCLIENT("[HTTP-Client][getResponseTextAsync] Remote host is not an HTTP Server!");
                    asyncHttpCode = HTTPCLIENTMOD_HTTPC_ERROR_NO_HTTP_SERVER;
                }
                return asyncHttpCode;
            }
        } else {
            if((millis() - lastSendRequestAsyncTime) > _tcpTimeout) {
                return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_READ_TIMEOUT);
            }
            esp_yield();
        }
    }
    return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_CONNECTION_LOST);
}

int HTTPClientMod::cancelRequestAsync()
{
    if(!connected()) {
        return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ERROR_NOT_CONNECTED);
    }
    end();
    if (_client)
        _client->stop();
    return asyncHttpCode = returnError(HTTPCLIENTMOD_HTTPC_ASYNC_ERROR_CANCELLED);
}

const String& HTTPClientMod::getStringAsync(void)
{
    if (_payload) {
        return *_payload;
    }

    _payload.reset(new StreamString());

    if(_size > 0) {
        // try to reserve needed memory
        if(!_payload->reserve((_size + 1))) {
            DEBUG_HTTPCLIENT("[HTTP-Client][getStringAsync] not enough memory to reserve a string! need: %d\n", (_size + 1));
            return *_payload;
        }
    }

    asyncHttpCode = writeToStream(_payload.get());
    return *_payload;
}

int HTTPClientMod::sendGetAsync()
{
    return sendRequestAsync("GET");
}

int HTTPClientMod::sendDeleteAsync()
{
    return sendRequestAsync("DELETE");
}

int HTTPClientMod::sendPostAsync(const uint8_t* payload, size_t size)
{
    return sendRequestAsync("POST", payload, size);
}

int HTTPClientMod::sendPostAsync(const String& payload)
{
    return sendPostAsync((uint8_t *) payload.c_str(), payload.length());
}

int HTTPClientMod::sendPutAsync(const uint8_t* payload, size_t size)
{
    return sendRequestAsync("PUT", payload, size);
}

int HTTPClientMod::sendPutAsync(const String& payload)
{
    return sendPutAsync((const uint8_t *) payload.c_str(), payload.length());
}

int HTTPClientMod::sendPatchAsync(const uint8_t * payload, size_t size)
{
    return sendRequestAsync("PATCH", payload, size);
}

int HTTPClientMod::sendPatchAsync(const String& payload)
{
    return sendPatchAsync((const uint8_t *) payload.c_str(), payload.length());
}

int HTTPClientMod::available()
{
    return _client->available();
}

//Must read response text before calling this
int HTTPClientMod::asyncResponseCode()
{
    return asyncHttpCode;
}

bool HTTPClientMod::asyncTimeout()
{
    return (millis() - lastSendRequestAsyncTime) > _tcpTimeout;
}

#endif